<?php
/*
 * Реализуйте рекурсивную функцию factorial, используя линейно-итеративный процесс.
 * 
 * factorial(3); // 6
*/
function factorial($num)
{
    // BEGIN (write your solution here)
    
    // END
}

/*
 * Реализуйте рекурсивную функцию smallestDivisor, используя линейно-итеративный процесс. Функция должна находить минимальный делитель переданного числа.
 *
 * Минимальный делитель числа - это наименьшее число, на которое делится исходное без остатка.
 *
 * smallestDivisor(9); // 3
 * smallestDivisor(17); // 17
 * Алгоритм
 * Для поиска этого числа достаточно последовательно проверять делимость начиная с двойки. Если делитель не найден, значит это само число, а искомое число простое.
 *
 * Подсказки
 * В PHP за нахождение остатка от деления отвечает операция %, например: 5 % 3; // 2
 */
function smallestDivisor($num)
{
    // BEGIN (write your solution here)
    
    // END
}
